Revit 2022 API
RebarInSystem.SetSolidInView Method
 Sets this rebar element to be shown solidly in a 3D view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2014
Syntax
C#
public void SetSolidInView(
	View3D view,
	bool solid
)
Visual Basic
Public Sub SetSolidInView ( _
	view As View3D, _
	solid As Boolean _
)
Visual C++
public:
void SetSolidInView(
	View3D^ view,
	bool solid
)
Parameters
view
Type: Autodesk.Revit.DB.View3D
 The 3D view element
solid
Type: System.Boolean
 True if rebar element is shown solidly, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InapplicableDataException |  This element doesn't have valid visibility data.
See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace